Revit 2027 API
FabricArea.FabricLocation Property
 The Fabric location in the host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricLocation FabricLocation { get; set; }
Public Property FabricLocation As FabricLocation
	Get
	Set
public:
property FabricLocation FabricLocation {
	FabricLocation get ();
	void set (FabricLocation value);
}
member FabricLocation : FabricLocation with get, set
Property Value
FabricLocation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace